In [9]:
import numpy as np
import pandas as pd

### 1. Lotto
#### Q1. 로또 번호 자동 생성 함수 만들기
- 1 부터 45가지의 숫자에서 랜덤으로 6개를 뽑으시오.

In [11]:
def lotto_num():
    x = np.random.randint(1,45,6)
    return print(x)

lotto_num()

[30  4 22  6 30 28]

## 2. titanic

#### Q2-1. titanic 데이터를 불러와 shape과 head()를 출력하시오

In [6]:
titanic = pd.read_csv("C:/Users/yiyeon/TIL/python_study/data/titanic.csv")
titanic.shape

(1309, 11)

In [22]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1st,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.337494,B5,Southampton
1,1st,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.550003,C22 C26,Southampton
2,1st,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.550003,C22 C26,Southampton
3,1st,0,"Allison, Mr. Hudson Joshua Crei",male,30.0000,1,2,113781,151.550003,C22 C26,Southampton
4,1st,0,"Allison, Mrs. Hudson J C (Bessi",female,25.0000,1,2,113781,151.550003,C22 C26,Southampton

#### Q2-2. titanic 데이터 형식을 확인하시오.

In [23]:
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

#### Q2-3. age(나이)가 30대(30~39) 이면서 pclass(승객 등급)이 2등석에 탄 사람만 선택하여 데이터를 출력하시오

In [14]:
titanic.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked'],
      dtype='object')

In [21]:
titanic[(titanic["age"]>=30) & (titanic["age"]<40) & (titanic["pclass"]=="2nd")].head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
323,2nd,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0,NaN,Cherbourg
325,2nd,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13.0,NaN,Southampton
328,2nd,0,"Angle, Mr. William A",male,34.0,1,0,226875,26.0,NaN,Southampton
329,2nd,1,"Angle, Mrs. William A (Florence",female,36.0,1,0,226875,26.0,NaN,Southampton
333,2nd,1,"Ball, Mrs. (Ada E Hall)",female,36.0,0,0,28551,13.0,D,Southampton

#### Q2-4. pclass(승객 등급) 별 평균 나이를 출력하시오.

In [26]:
titanic.groupby('pclass').mean()[['age']]

              age
pclass
1st     39.159918
2nd     29.506705
3rd     24.816367

#### Q2-5. pclass(승객 등급)별, sex(성)별에 따른 평균 생존률을 출력하시오.

In [28]:
titanic.groupby(['pclass','sex']).mean()[['survived']]

               survived
pclass sex
1st    female  0.965278
       male    0.340782
2nd    female  0.886792
       male    0.146199
3rd    female  0.490741
       male    0.152130